RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/COMPONENT_CAT1C/source/triggers/cyhal_triggers_xmc7100.c
const _cyhal_trigger_source_xmc7100_t cyhal_mux10_sources[188] =
{
    _CYHAL_TRIGGER_CPUSS_ZERO,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT0,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT1,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT2,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT3,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT4,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT5,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT6,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT7,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT8,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT9,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT10,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT11,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT12,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT13,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT14,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT15,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT16,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT17,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT18,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT19,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT20,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT21,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT22,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT23,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT24,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT25,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT26,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT27,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT28,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT29,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT30,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT31,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT32,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT33,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT34,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT35,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT36,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT37,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT38,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT39,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT40,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT41,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT42,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT43,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT44,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT45,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT46,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT47,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT48,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT49,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT50,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT51,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT52,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT53,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT54,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT55,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT56,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT57,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT58,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT59,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT60,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT61,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT62,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT63,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT64,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT65,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT66,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT67,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT68,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT69,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT70,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT71,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT72,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT73,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT74,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT75,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT76,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT77,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT78,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT79,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT80,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT81,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT82,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT83,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT84,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT85,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT86,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT87,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT88,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT89,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT90,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT91,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT92,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT93,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT94,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT95,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT96,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT97,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT98,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT99,
    _CYHAL_TRIGGER_SCB0_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB1_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB2_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB3_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB4_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB5_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB6_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB7_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB8_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB9_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB10_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB0_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB1_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB2_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB3_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB4_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB5_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB6_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB7_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB8_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB9_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB10_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB0_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB1_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB2_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB3_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB4_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB5_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB6_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB7_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB8_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB9_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB10_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_CANFD0_TR_DBG_DMA_REQ0,
    _CYHAL_TRIGGER_CANFD0_TR_DBG_DMA_REQ1,
    _CYHAL_TRIGGER_CANFD0_TR_DBG_DMA_REQ2,
    _CYHAL_TRIGGER_CANFD0_TR_DBG_DMA_REQ3,
    _CYHAL_TRIGGER_CANFD0_TR_FIFO00,
    _CYHAL_TRIGGER_CANFD0_TR_FIFO01,
    _CYHAL_TRIGGER_CANFD0_TR_FIFO02,
    _CYHAL_TRIGGER_CANFD0_TR_FIFO03,
    _CYHAL_TRIGGER_CANFD0_TR_FIFO10,
    _CYHAL_TRIGGER_CANFD0_TR_FIFO11,
    _CYHAL_TRIGGER_CANFD0_TR_FIFO12,
    _CYHAL_TRIGGER_CANFD0_TR_FIFO13,
    _CYHAL_TRIGGER_CANFD0_TR_TMP_RTP_OUT0,
    _CYHAL_TRIGGER_CANFD0_TR_TMP_RTP_OUT1,
    _CYHAL_TRIGGER_CANFD0_TR_TMP_RTP_OUT2,
    _CYHAL_TRIGGER_CANFD0_TR_TMP_RTP_OUT3,
    _CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_REQ0,
    _CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_REQ1,
    _CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_REQ2,
    _CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_REQ3,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO00,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO01,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO02,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO03,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO10,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO11,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO12,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO13,
    _CYHAL_TRIGGER_CANFD1_TR_TMP_RTP_OUT0,
    _CYHAL_TRIGGER_CANFD1_TR_TMP_RTP_OUT1,
    _CYHAL_TRIGGER_CANFD1_TR_TMP_RTP_OUT2,
    _CYHAL_TRIGGER_CANFD1_TR_TMP_RTP_OUT3,
    _CYHAL_TRIGGER_CPUSS_CTI_TR_OUT0,
    _CYHAL_TRIGGER_CPUSS_CTI_TR_OUT1,
    _CYHAL_TRIGGER_CPUSS_TR_FAULT0,
    _CYHAL_TRIGGER_CPUSS_TR_FAULT1,
    _CYHAL_TRIGGER_CPUSS_TR_FAULT2,
    _CYHAL_TRIGGER_CPUSS_TR_FAULT3,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT0,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT1,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT2,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT3,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT4,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT5,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT6,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT7,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT8,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT9,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT10,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT11,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT12,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT13,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT14,
    _CYHAL_TRIGGER_EVTGEN0_TR_OUT15,
};

const _cyhal_trigger_source_xmc7100_t cyhal_mux11_sources[124] =
{
    _CYHAL_TRIGGER_CPUSS_ZERO,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0512,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0513,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0514,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0515,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0516,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0517,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0518,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0519,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0256,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0257,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0258,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0259,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0260,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0261,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0262,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0263,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0264,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0265,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0266,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT0267,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT00,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT01,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT02,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT03,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT04,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT05,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT06,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT07,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT08,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT09,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT010,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT011,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT012,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT013,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT014,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT015,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT016,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT017,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT018,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT019,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT020,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT021,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT022,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT023,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT024,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT025,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT026,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT027,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT028,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT029,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT030,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT031,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT032,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT033,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT034,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT035,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT036,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT037,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT038,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT039,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT040,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT041,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT042,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT043,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT044,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT045,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT046,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT047,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT048,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT049,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT050,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT051,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT052,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT053,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT054,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT055,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT056,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT057,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT058,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT059,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT060,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT061,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT062,
    _CYHAL_TRIGGER_SMIF0_TR_TX_REQ,
    _CYHAL_TRIGGER_SMIF0_TR_RX_REQ,
    _CYHAL_TRIGGER_AUDIOSS0_TR_I2S_TX_REQ,
    _CYHAL_TRIGGER_AUDIOSS0_TR_I2S_RX_REQ,
    _CYHAL_TRIGGER_AUDIOSS1_TR_I2S_TX_REQ,
    _CYHAL_TRIGGER_AUDIOSS1_TR_I2S_RX_REQ,
    _CYHAL_TRIGGER_AUDIOSS2_TR_I2S_TX_REQ,
    _CYHAL_TRIGGER_AUDIOSS2_TR_I2S_RX_REQ,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT0,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT1,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT2,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT3,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT4,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT5,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT6,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT7,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT8,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT9,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT10,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT11,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT12,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT13,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT14,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT15,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT16,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT17,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT18,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT19,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT20,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT21,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT22,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT23,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT24,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT25,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT26,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT27,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT28,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT29,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT30,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT31,
};

const _cyhal_trigger_source_xmc7100_t cyhal_mux12_sources[156] =
{
    _CYHAL_TRIGGER_CPUSS_ZERO,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT0,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT1,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT2,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT3,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT4,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT5,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT6,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT7,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT8,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT9,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT10,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT11,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT12,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT13,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT14,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT15,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT16,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT17,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT18,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT19,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT20,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT21,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT22,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT23,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT24,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT25,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT26,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT27,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT28,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT29,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT30,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT31,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT32,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT33,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT34,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT35,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT36,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT37,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT38,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT39,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT40,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT41,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT42,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT43,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT44,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT45,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT46,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT47,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT48,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT49,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT50,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT51,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT52,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT53,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT54,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT55,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT56,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT57,
    _CYHAL_TRIGGER_CPUSS_DMAC_TR_OUT0,
    _CYHAL_TRIGGER_CPUSS_DMAC_TR_OUT1,
    _CYHAL_TRIGGER_CPUSS_DMAC_TR_OUT2,
    _CYHAL_TRIGGER_CPUSS_DMAC_TR_OUT3,
    _CYHAL_TRIGGER_CPUSS_DMAC_TR_OUT4,
    _CYHAL_TRIGGER_CPUSS_DMAC_TR_OUT5,
    _CYHAL_TRIGGER_CPUSS_DMAC_TR_OUT6,
    _CYHAL_TRIGGER_CPUSS_DMAC_TR_OUT7,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT10,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT11,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT12,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT13,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT14,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT15,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT16,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT17,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT18,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT19,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT110,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT111,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT112,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT113,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT114,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT115,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT116,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT117,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT118,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT119,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT120,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT121,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT122,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT123,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT124,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT125,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT126,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT127,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT128,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT129,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT130,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT131,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT132,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT133,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT134,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT135,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT136,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT137,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT138,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT139,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT140,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT141,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT142,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT143,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT144,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT145,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT146,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT147,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT148,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT149,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT150,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT151,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT152,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT153,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT154,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT155,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT156,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT157,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT158,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT159,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT160,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT161,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT162,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT1256,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT1257,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT1258,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT1259,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT1260,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT1261,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT1262,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT1263,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT1264,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT1265,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT1266,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT1267,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT1512,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT1513,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT1514,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT1515,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT1516,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT1517,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT1518,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT1519,
    _CYHAL_TRIGGER_PASS0_TR_SAR_GEN_OUT0,
    _CYHAL_TRIGGER_PASS0_TR_SAR_GEN_OUT1,
    _CYHAL_TRIGGER_PASS0_TR_SAR_GEN_OUT2,
    _CYHAL_TRIGGER_PASS0_TR_SAR_GEN_OUT3,
    _CYHAL_TRIGGER_PASS0_TR_SAR_GEN_OUT4,
    _CYHAL_TRIGGER_PASS0_TR_SAR_GEN_OUT5,
};

const _cyhal_trigger_source_xmc7100_t cyhal_mux13_sources[12] =
{
    _CYHAL_TRIGGER_CANFD0_TR_DBG_DMA_REQ0,
    _CYHAL_TRIGGER_CANFD0_TR_FIFO00,
    _CYHAL_TRIGGER_CANFD0_TR_FIFO10,
    _CYHAL_TRIGGER_CANFD0_TR_DBG_DMA_REQ1,
    _CYHAL_TRIGGER_CANFD0_TR_FIFO01,
    _CYHAL_TRIGGER_CANFD0_TR_FIFO11,
    _CYHAL_TRIGGER_CANFD0_TR_DBG_DMA_REQ2,
    _CYHAL_TRIGGER_CANFD0_TR_FIFO02,
    _CYHAL_TRIGGER_CANFD0_TR_FIFO12,
    _CYHAL_TRIGGER_CANFD0_TR_DBG_DMA_REQ3,
    _CYHAL_TRIGGER_CANFD0_TR_FIFO03,
    _CYHAL_TRIGGER_CANFD0_TR_FIFO13,
};

const _cyhal_trigger_source_xmc7100_t cyhal_mux14_sources[72] =
{
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE0,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE1,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE2,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE3,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE4,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE5,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE6,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE7,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE8,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE9,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE10,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE11,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE12,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE13,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE14,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE15,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE16,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE17,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE18,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE19,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE20,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE21,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE22,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE23,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE24,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE25,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE26,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE27,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE28,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE29,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE30,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE31,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE32,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE33,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE34,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE35,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE36,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE37,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE38,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE39,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE40,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE41,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE42,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE43,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE44,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE45,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE46,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE47,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE48,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE49,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE50,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE51,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE52,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE53,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE54,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE55,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE56,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE57,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE58,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE59,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE60,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE61,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE62,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE63,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE64,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE65,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE66,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE67,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE68,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE69,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE70,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_DONE71,
};

const _cyhal_trigger_source_xmc7100_t cyhal_mux15_sources[22] =
{
    _CYHAL_TRIGGER_SCB0_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB0_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB1_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB1_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB2_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB2_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB3_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB3_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB4_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB4_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB5_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB5_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB6_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB6_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB7_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB7_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB8_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB8_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB9_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB9_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB10_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB10_TR_RX_REQ,
};

