RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/COMPONENT_CAT1C/source/triggers/cyhal_triggers_xmc7100.c
const _cyhal_trigger_source_xmc7100_t cyhal_mux16_sources[2] =
{
    _CYHAL_TRIGGER_SMIF0_TR_TX_REQ,
    _CYHAL_TRIGGER_SMIF0_TR_RX_REQ,
};

const _cyhal_trigger_source_xmc7100_t cyhal_mux17_sources[12] =
{
    _CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_REQ0,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO00,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO10,
    _CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_REQ1,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO01,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO11,
    _CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_REQ2,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO02,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO12,
    _CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_REQ3,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO03,
    _CYHAL_TRIGGER_CANFD1_TR_FIFO13,
};

const _cyhal_trigger_source_xmc7100_t cyhal_mux18_sources[6] =
{
    _CYHAL_TRIGGER_AUDIOSS0_TR_I2S_TX_REQ,
    _CYHAL_TRIGGER_AUDIOSS0_TR_I2S_RX_REQ,
    _CYHAL_TRIGGER_AUDIOSS1_TR_I2S_TX_REQ,
    _CYHAL_TRIGGER_AUDIOSS1_TR_I2S_RX_REQ,
    _CYHAL_TRIGGER_AUDIOSS2_TR_I2S_TX_REQ,
    _CYHAL_TRIGGER_AUDIOSS2_TR_I2S_RX_REQ,
};

const _cyhal_trigger_source_xmc7100_t cyhal_mux19_sources[72] =
{
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO0,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO1,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO2,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO3,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO4,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO5,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO6,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO7,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO8,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO9,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO10,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO11,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO12,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO13,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO14,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO15,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO16,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO17,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO18,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO19,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO20,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO21,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO22,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO23,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO24,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO25,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO26,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO27,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO28,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO29,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO30,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO31,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO32,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO33,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO34,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO35,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO36,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO37,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO38,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO39,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO40,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO41,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO42,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO43,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO44,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO45,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO46,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO47,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO48,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO49,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO50,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO51,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO52,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO53,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO54,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO55,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO56,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO57,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO58,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO59,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO60,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO61,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO62,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO63,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO64,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO65,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO66,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO67,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO68,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO69,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO70,
    _CYHAL_TRIGGER_PASS0_TR_SAR_CH_RANGEVIO71,
};

const _cyhal_trigger_source_xmc7100_t cyhal_mux20_sources[72] =
{
    _CYHAL_TRIGGER_TCPWM0_TR_OUT1256,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT1259,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT1262,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT1265,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT10,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT11,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT12,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT13,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT14,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT15,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT16,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT17,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT18,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT19,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT110,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT111,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT112,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT113,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT114,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT115,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT116,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT117,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT118,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT119,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT120,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT121,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT122,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT123,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT124,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT125,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT126,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT127,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT1257,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT1260,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT1263,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT1266,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT128,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT129,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT130,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT131,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT132,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT133,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT134,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT135,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT136,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT137,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT138,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT139,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT140,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT141,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT142,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT143,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT144,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT145,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT146,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT147,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT148,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT149,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT150,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT151,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT152,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT153,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT154,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT155,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT1258,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT1261,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT1264,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT1267,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT156,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT157,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT158,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT159,
};

const _cyhal_trigger_source_xmc7100_t cyhal_mux21_sources[4] =
{
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT38,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT41,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT44,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT47,
};

const _cyhal_trigger_source_xmc7100_t cyhal_mux22_sources[4] =
{
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT16,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT19,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT22,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT25,
};

const _cyhal_trigger_source_xmc7100_t cyhal_mux23_sources[16] =
{
    _CYHAL_TRIGGER_TCPWM0_TR_OUT00,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT01,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT02,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT03,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT04,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT05,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT06,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT07,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT08,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT09,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT010,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT011,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT012,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT013,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT014,
    _CYHAL_TRIGGER_TCPWM0_TR_OUT015,
};

const _cyhal_trigger_source_xmc7100_t* cyhal_mux_to_sources[24] =
{
    cyhal_mux0_sources, 
    cyhal_mux1_sources, 
    cyhal_mux2_sources, 
    cyhal_mux3_sources, 
    NULL, 
    cyhal_mux5_sources, 
    cyhal_mux6_sources, 
    cyhal_mux7_sources, 
    cyhal_mux8_sources, 
    cyhal_mux9_sources, 
    cyhal_mux10_sources, 
    cyhal_mux11_sources, 
    cyhal_mux12_sources, 
    cyhal_mux13_sources, 
    cyhal_mux14_sources, 
    cyhal_mux15_sources, 
    cyhal_mux16_sources, 
    cyhal_mux17_sources, 
    cyhal_mux18_sources, 
    cyhal_mux19_sources, 
    cyhal_mux20_sources, 
    cyhal_mux21_sources, 
    cyhal_mux22_sources, 
    cyhal_mux23_sources, 
};

