RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/COMPONENT_CAT1C/source/triggers/cyhal_triggers_xmc7100.c
const uint8_t cyhal_dest_to_mux[407] =
{
    137, /* CYHAL_TRIGGER_CANFD0_TR_DBG_DMA_ACK0 */
    137, /* CYHAL_TRIGGER_CANFD0_TR_DBG_DMA_ACK1 */
    137, /* CYHAL_TRIGGER_CANFD0_TR_DBG_DMA_ACK2 */
    137, /* CYHAL_TRIGGER_CANFD0_TR_DBG_DMA_ACK3 */
    136, /* CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_ACK0 */
    136, /* CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_ACK1 */
    136, /* CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_ACK2 */
    136, /* CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_ACK3 */
    8, /* CYHAL_TRIGGER_CANFD0_TR_EVT_SWT_IN0 */
    8, /* CYHAL_TRIGGER_CANFD0_TR_EVT_SWT_IN1 */
    8, /* CYHAL_TRIGGER_CANFD0_TR_EVT_SWT_IN2 */
    8, /* CYHAL_TRIGGER_CANFD0_TR_EVT_SWT_IN3 */
    8, /* CYHAL_TRIGGER_CANFD1_TR_EVT_SWT_IN0 */
    8, /* CYHAL_TRIGGER_CANFD1_TR_EVT_SWT_IN1 */
    8, /* CYHAL_TRIGGER_CANFD1_TR_EVT_SWT_IN2 */
    8, /* CYHAL_TRIGGER_CANFD1_TR_EVT_SWT_IN3 */
    9, /* CYHAL_TRIGGER_CPUSS_CTI_TR_IN0 */
    9, /* CYHAL_TRIGGER_CPUSS_CTI_TR_IN1 */
    3, /* CYHAL_TRIGGER_CPUSS_DMAC_TR_IN0 */
    3, /* CYHAL_TRIGGER_CPUSS_DMAC_TR_IN1 */
    3, /* CYHAL_TRIGGER_CPUSS_DMAC_TR_IN2 */
    3, /* CYHAL_TRIGGER_CPUSS_DMAC_TR_IN3 */
    3, /* CYHAL_TRIGGER_CPUSS_DMAC_TR_IN4 */
    3, /* CYHAL_TRIGGER_CPUSS_DMAC_TR_IN5 */
    3, /* CYHAL_TRIGGER_CPUSS_DMAC_TR_IN6 */
    3, /* CYHAL_TRIGGER_CPUSS_DMAC_TR_IN7 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN0 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN1 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN2 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN3 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN4 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN5 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN6 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN7 */
    1, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN8 */
    1, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN9 */
    1, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN10 */
    1, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN11 */
    1, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN12 */
    1, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN13 */
    1, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN14 */
    1, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN15 */
    128, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN16 */
    128, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN17 */
    128, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN18 */
    128, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN19 */
    128, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN20 */
    128, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN21 */
    128, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN22 */
    128, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN23 */
    128, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN24 */
    128, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN25 */
    128, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN26 */
    128, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN27 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN28 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN29 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN30 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN31 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN32 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN33 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN34 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN35 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN36 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN37 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN38 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN39 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN40 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN41 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN42 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN43 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN44 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN45 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN46 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN47 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN48 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN49 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN50 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN51 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN52 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN53 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN54 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN55 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN56 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN57 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN58 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN59 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN60 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN61 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN62 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN63 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN64 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN65 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN66 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN67 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN68 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN69 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN70 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN71 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN72 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN73 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN74 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN75 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN76 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN77 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN78 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN79 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN80 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN81 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN82 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN83 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN84 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN85 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN86 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN87 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN88 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN89 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN90 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN91 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN92 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN93 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN94 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN95 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN96 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN97 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN98 */
    129, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN99 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN0 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN1 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN2 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN3 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN4 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN5 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN6 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN7 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN8 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN9 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN10 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN11 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN12 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN13 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN14 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN15 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN16 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN17 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN18 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN19 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN20 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN21 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN22 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN23 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN24 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN25 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN26 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN27 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN28 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN29 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN30 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN31 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN32 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN33 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN34 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN35 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN36 */
    130, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN37 */
    132, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN38 */
    132, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN39 */
    132, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN40 */
    132, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN41 */
    132, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN42 */
    132, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN43 */
    132, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN44 */
    132, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN45 */
    132, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN46 */
    132, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN47 */
    132, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN48 */
    132, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN49 */
    131, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN50 */
    131, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN51 */
    133, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN52 */
    133, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN53 */
    133, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN54 */
    133, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN55 */
    133, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN56 */
    133, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN57 */
    138, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER0 */
    138, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER1 */
    138, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER2 */
    138, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER3 */
    138, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER4 */
    138, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER5 */
    138, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER6 */
    138, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER7 */
    138, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER8 */
    138, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER9 */
    138, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER10 */
    138, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER11 */
    138, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER12 */
    138, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER13 */
    138, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER14 */
    138, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER15 */
    9, /* CYHAL_TRIGGER_PASS0_TR_DEBUG_FREEZE */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN0 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN1 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN2 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN3 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN4 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN5 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN6 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN7 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN8 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN9 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN10 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN11 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN12 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN13 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN14 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN15 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN16 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN17 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN18 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN19 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN20 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN21 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN22 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN23 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN24 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN25 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN26 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN27 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN28 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN29 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN30 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN31 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN32 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN33 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN34 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN35 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN36 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN37 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN38 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN39 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN40 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN41 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN42 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN43 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN44 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN45 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN46 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN47 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN48 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN49 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN50 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN51 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN52 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN53 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN54 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN55 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN56 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN57 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN58 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN59 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN60 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN61 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN62 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN63 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN64 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN65 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN66 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN67 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN68 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN69 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN70 */
    135, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN71 */
    7, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN0 */
    7, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN1 */
    7, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN2 */
    7, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN3 */
    7, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN4 */
    7, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN5 */
    7, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN6 */
    7, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN7 */
    7, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN8 */
    7, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN9 */
    7, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN10 */
    7, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN11 */
    9, /* CYHAL_TRIGGER_PERI_TR_DBG_FREEZE */
    9, /* CYHAL_TRIGGER_PERI_TR_IO_OUTPUT0 */
    9, /* CYHAL_TRIGGER_PERI_TR_IO_OUTPUT1 */
    9, /* CYHAL_TRIGGER_SRSS_TR_DEBUG_FREEZE_MCWDT0 */
    9, /* CYHAL_TRIGGER_SRSS_TR_DEBUG_FREEZE_MCWDT1 */
    9, /* CYHAL_TRIGGER_SRSS_TR_DEBUG_FREEZE_MCWDT2 */
    9, /* CYHAL_TRIGGER_SRSS_TR_DEBUG_FREEZE_WDT */
    5, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN0 */
    5, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN1 */
    5, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN2 */
    5, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN3 */
    5, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN4 */
    5, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN5 */
    5, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN6 */
    5, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN7 */
    5, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN8 */
    5, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN9 */
    5, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN10 */
    5, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN11 */
    6, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN12 */
    6, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN13 */
    6, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN14 */
    6, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN15 */
    6, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN16 */
    6, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN17 */
    6, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN18 */
    6, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN19 */
    6, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN20 */
    6, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN21 */
    6, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN22 */
    6, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN23 */
    6, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN24 */
    6, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN25 */
    6, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN26 */
    9, /* CYHAL_TRIGGER_TCPWM0_TR_DEBUG_FREEZE */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN2 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN5 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN8 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN11 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN14 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN17 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN20 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN23 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN26 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN29 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN32 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN35 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN38 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN41 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN44 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN47 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN50 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN53 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN56 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN59 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN62 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN65 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN68 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN71 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN74 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN77 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN80 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN83 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN86 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN89 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN92 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN95 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN98 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN101 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN104 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN107 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN110 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN113 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN116 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN119 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN122 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN125 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN128 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN131 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN134 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN137 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN140 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN143 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN146 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN149 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN152 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN155 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN158 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN161 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN164 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN167 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN170 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN173 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN176 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN179 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN770 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN773 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN776 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN779 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN782 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN785 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN788 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN791 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN794 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN797 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN800 */
    134, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN803 */
    10, /* CYHAL_TRIGGER_TR_GROUP9_INPUT1 */
    10, /* CYHAL_TRIGGER_TR_GROUP9_INPUT2 */
    10, /* CYHAL_TRIGGER_TR_GROUP9_INPUT3 */
    10, /* CYHAL_TRIGGER_TR_GROUP9_INPUT4 */
    10, /* CYHAL_TRIGGER_TR_GROUP9_INPUT5 */
    11, /* CYHAL_TRIGGER_TR_GROUP9_INPUT6 */
    11, /* CYHAL_TRIGGER_TR_GROUP9_INPUT7 */
    11, /* CYHAL_TRIGGER_TR_GROUP9_INPUT8 */
    11, /* CYHAL_TRIGGER_TR_GROUP9_INPUT9 */
    11, /* CYHAL_TRIGGER_TR_GROUP9_INPUT10 */
    12, /* CYHAL_TRIGGER_TR_GROUP9_INPUT11 */
    12, /* CYHAL_TRIGGER_TR_GROUP9_INPUT12 */
    12, /* CYHAL_TRIGGER_TR_GROUP9_INPUT13 */
    12, /* CYHAL_TRIGGER_TR_GROUP9_INPUT14 */
    12, /* CYHAL_TRIGGER_TR_GROUP9_INPUT15 */
};

