RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/COMPONENT_CAT1C/source/triggers/cyhal_triggers_xmc7100.c
const uint8_t cyhal_mux_dest_index[407] =
{
    0, /* CYHAL_TRIGGER_CANFD0_TR_DBG_DMA_ACK0 */
    1, /* CYHAL_TRIGGER_CANFD0_TR_DBG_DMA_ACK1 */
    2, /* CYHAL_TRIGGER_CANFD0_TR_DBG_DMA_ACK2 */
    3, /* CYHAL_TRIGGER_CANFD0_TR_DBG_DMA_ACK3 */
    0, /* CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_ACK0 */
    1, /* CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_ACK1 */
    2, /* CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_ACK2 */
    3, /* CYHAL_TRIGGER_CANFD1_TR_DBG_DMA_ACK3 */
    0, /* CYHAL_TRIGGER_CANFD0_TR_EVT_SWT_IN0 */
    1, /* CYHAL_TRIGGER_CANFD0_TR_EVT_SWT_IN1 */
    2, /* CYHAL_TRIGGER_CANFD0_TR_EVT_SWT_IN2 */
    3, /* CYHAL_TRIGGER_CANFD0_TR_EVT_SWT_IN3 */
    4, /* CYHAL_TRIGGER_CANFD1_TR_EVT_SWT_IN0 */
    5, /* CYHAL_TRIGGER_CANFD1_TR_EVT_SWT_IN1 */
    6, /* CYHAL_TRIGGER_CANFD1_TR_EVT_SWT_IN2 */
    7, /* CYHAL_TRIGGER_CANFD1_TR_EVT_SWT_IN3 */
    2, /* CYHAL_TRIGGER_CPUSS_CTI_TR_IN0 */
    3, /* CYHAL_TRIGGER_CPUSS_CTI_TR_IN1 */
    0, /* CYHAL_TRIGGER_CPUSS_DMAC_TR_IN0 */
    1, /* CYHAL_TRIGGER_CPUSS_DMAC_TR_IN1 */
    2, /* CYHAL_TRIGGER_CPUSS_DMAC_TR_IN2 */
    3, /* CYHAL_TRIGGER_CPUSS_DMAC_TR_IN3 */
    4, /* CYHAL_TRIGGER_CPUSS_DMAC_TR_IN4 */
    5, /* CYHAL_TRIGGER_CPUSS_DMAC_TR_IN5 */
    6, /* CYHAL_TRIGGER_CPUSS_DMAC_TR_IN6 */
    7, /* CYHAL_TRIGGER_CPUSS_DMAC_TR_IN7 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN0 */
    1, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN1 */
    2, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN2 */
    3, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN3 */
    4, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN4 */
    5, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN5 */
    6, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN6 */
    7, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN7 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN8 */
    1, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN9 */
    2, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN10 */
    3, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN11 */
    4, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN12 */
    5, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN13 */
    6, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN14 */
    7, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN15 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN16 */
    1, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN17 */
    2, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN18 */
    3, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN19 */
    4, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN20 */
    5, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN21 */
    6, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN22 */
    7, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN23 */
    8, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN24 */
    9, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN25 */
    10, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN26 */
    11, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN27 */
    0, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN28 */
    1, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN29 */
    2, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN30 */
    3, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN31 */
    4, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN32 */
    5, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN33 */
    6, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN34 */
    7, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN35 */
    8, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN36 */
    9, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN37 */
    10, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN38 */
    11, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN39 */
    12, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN40 */
    13, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN41 */
    14, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN42 */
    15, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN43 */
    16, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN44 */
    17, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN45 */
    18, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN46 */
    19, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN47 */
    20, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN48 */
    21, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN49 */
    22, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN50 */
    23, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN51 */
    24, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN52 */
    25, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN53 */
    26, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN54 */
    27, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN55 */
    28, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN56 */
    29, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN57 */
    30, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN58 */
    31, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN59 */
    32, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN60 */
    33, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN61 */
    34, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN62 */
    35, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN63 */
    36, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN64 */
    37, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN65 */
    38, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN66 */
    39, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN67 */
    40, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN68 */
    41, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN69 */
    42, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN70 */
    43, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN71 */
    44, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN72 */
    45, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN73 */
    46, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN74 */
    47, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN75 */
    48, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN76 */
    49, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN77 */
    50, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN78 */
    51, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN79 */
    52, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN80 */
    53, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN81 */
    54, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN82 */
    55, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN83 */
    56, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN84 */
    57, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN85 */
    58, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN86 */
    59, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN87 */
    60, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN88 */
    61, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN89 */
    62, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN90 */
    63, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN91 */
    64, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN92 */
    65, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN93 */
    66, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN94 */
    67, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN95 */
    68, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN96 */
    69, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN97 */
    70, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN98 */
    71, /* CYHAL_TRIGGER_CPUSS_DW0_TR_IN99 */
    0, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN0 */
    1, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN1 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN2 */
    3, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN3 */
    4, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN4 */
    5, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN5 */
    6, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN6 */
    7, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN7 */
    8, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN8 */
    9, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN9 */
    10, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN10 */
    11, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN11 */
    12, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN12 */
    13, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN13 */
    14, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN14 */
    15, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN15 */
    0, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN16 */
    1, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN17 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN18 */
    3, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN19 */
    4, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN20 */
    5, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN21 */
    6, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN22 */
    7, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN23 */
    8, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN24 */
    9, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN25 */
    10, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN26 */
    11, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN27 */
    12, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN28 */
    13, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN29 */
    14, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN30 */
    15, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN31 */
    16, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN32 */
    17, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN33 */
    18, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN34 */
    19, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN35 */
    20, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN36 */
    21, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN37 */
    0, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN38 */
    1, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN39 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN40 */
    3, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN41 */
    4, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN42 */
    5, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN43 */
    6, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN44 */
    7, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN45 */
    8, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN46 */
    9, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN47 */
    10, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN48 */
    11, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN49 */
    0, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN50 */
    1, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN51 */
    0, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN52 */
    1, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN53 */
    2, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN54 */
    3, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN55 */
    4, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN56 */
    5, /* CYHAL_TRIGGER_CPUSS_DW1_TR_IN57 */
    0, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER0 */
    1, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER1 */
    2, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER2 */
    3, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER3 */
    4, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER4 */
    5, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER5 */
    6, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER6 */
    7, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER7 */
    8, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER8 */
    9, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER9 */
    10, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER10 */
    11, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER11 */
    12, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER12 */
    13, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER13 */
    14, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER14 */
    15, /* CYHAL_TRIGGER_LIN0_TR_CMD_TX_HEADER15 */
    5, /* CYHAL_TRIGGER_PASS0_TR_DEBUG_FREEZE */
    0, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN0 */
    1, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN1 */
    2, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN2 */
    3, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN3 */
    4, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN4 */
    5, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN5 */
    6, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN6 */
    7, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN7 */
    8, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN8 */
    9, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN9 */
    10, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN10 */
    11, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN11 */
    12, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN12 */
    13, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN13 */
    14, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN14 */
    15, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN15 */
    16, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN16 */
    17, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN17 */
    18, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN18 */
    19, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN19 */
    20, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN20 */
    21, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN21 */
    22, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN22 */
    23, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN23 */
    24, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN24 */
    25, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN25 */
    26, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN26 */
    27, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN27 */
    28, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN28 */
    29, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN29 */
    30, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN30 */
    31, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN31 */
    32, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN32 */
    33, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN33 */
    34, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN34 */
    35, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN35 */
    36, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN36 */
    37, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN37 */
    38, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN38 */
    39, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN39 */
    40, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN40 */
    41, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN41 */
    42, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN42 */
    43, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN43 */
    44, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN44 */
    45, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN45 */
    46, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN46 */
    47, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN47 */
    48, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN48 */
    49, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN49 */
    50, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN50 */
    51, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN51 */
    52, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN52 */
    53, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN53 */
    54, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN54 */
    55, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN55 */
    56, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN56 */
    57, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN57 */
    58, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN58 */
    59, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN59 */
    60, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN60 */
    61, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN61 */
    62, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN62 */
    63, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN63 */
    64, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN64 */
    65, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN65 */
    66, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN66 */
    67, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN67 */
    68, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN68 */
    69, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN69 */
    70, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN70 */
    71, /* CYHAL_TRIGGER_PASS0_TR_SAR_CH_IN71 */
    0, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN0 */
    1, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN1 */
    2, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN2 */
    3, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN3 */
    4, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN4 */
    5, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN5 */
    6, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN6 */
    7, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN7 */
    8, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN8 */
    9, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN9 */
    10, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN10 */
    11, /* CYHAL_TRIGGER_PASS0_TR_SAR_GEN_IN11 */
    4, /* CYHAL_TRIGGER_PERI_TR_DBG_FREEZE */
    0, /* CYHAL_TRIGGER_PERI_TR_IO_OUTPUT0 */
    1, /* CYHAL_TRIGGER_PERI_TR_IO_OUTPUT1 */
    9, /* CYHAL_TRIGGER_SRSS_TR_DEBUG_FREEZE_MCWDT0 */
    8, /* CYHAL_TRIGGER_SRSS_TR_DEBUG_FREEZE_MCWDT1 */
    7, /* CYHAL_TRIGGER_SRSS_TR_DEBUG_FREEZE_MCWDT2 */
    6, /* CYHAL_TRIGGER_SRSS_TR_DEBUG_FREEZE_WDT */
    0, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN0 */
    1, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN1 */
    2, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN2 */
    3, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN3 */
    4, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN4 */
    5, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN5 */
    6, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN6 */
    7, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN7 */
    8, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN8 */
    9, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN9 */
    10, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN10 */
    11, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN11 */
    0, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN12 */
    1, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN13 */
    2, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN14 */
    3, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN15 */
    4, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN16 */
    5, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN17 */
    6, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN18 */
    7, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN19 */
    8, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN20 */
    9, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN21 */
    10, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN22 */
    11, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN23 */
    12, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN24 */
    13, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN25 */
    14, /* CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN26 */
    10, /* CYHAL_TRIGGER_TCPWM0_TR_DEBUG_FREEZE */
    4, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN2 */
    5, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN5 */
    6, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN8 */
    7, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN11 */
    8, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN14 */
    9, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN17 */
    10, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN20 */
    11, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN23 */
    12, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN26 */
    13, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN29 */
    14, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN32 */
    15, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN35 */
    16, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN38 */
    17, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN41 */
    18, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN44 */
    19, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN47 */
    20, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN50 */
    21, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN53 */
    22, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN56 */
    23, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN59 */
    24, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN62 */
    25, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN65 */
    26, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN68 */
    27, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN71 */
    28, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN74 */
    29, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN77 */
    30, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN80 */
    31, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN83 */
    36, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN86 */
    37, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN89 */
    38, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN92 */
    39, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN95 */
    40, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN98 */
    41, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN101 */
    42, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN104 */
    43, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN107 */
    44, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN110 */
    45, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN113 */
    46, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN116 */
    47, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN119 */
    48, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN122 */
    49, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN125 */
    50, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN128 */
    51, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN131 */
    52, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN134 */
    53, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN137 */
    54, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN140 */
    55, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN143 */
    56, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN146 */
    57, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN149 */
    58, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN152 */
    59, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN155 */
    60, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN158 */
    61, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN161 */
    62, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN164 */
    63, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN167 */
    68, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN170 */
    69, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN173 */
    70, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN176 */
    71, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN179 */
    0, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN770 */
    32, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN773 */
    64, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN776 */
    1, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN779 */
    33, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN782 */
    65, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN785 */
    2, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN788 */
    34, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN791 */
    66, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN794 */
    3, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN797 */
    35, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN800 */
    67, /* CYHAL_TRIGGER_TCPWM0_TR_ONE_CNT_IN803 */
    0, /* CYHAL_TRIGGER_TR_GROUP9_INPUT1 */
    1, /* CYHAL_TRIGGER_TR_GROUP9_INPUT2 */
    2, /* CYHAL_TRIGGER_TR_GROUP9_INPUT3 */
    3, /* CYHAL_TRIGGER_TR_GROUP9_INPUT4 */
    4, /* CYHAL_TRIGGER_TR_GROUP9_INPUT5 */
    0, /* CYHAL_TRIGGER_TR_GROUP9_INPUT6 */
    1, /* CYHAL_TRIGGER_TR_GROUP9_INPUT7 */
    2, /* CYHAL_TRIGGER_TR_GROUP9_INPUT8 */
    3, /* CYHAL_TRIGGER_TR_GROUP9_INPUT9 */
    4, /* CYHAL_TRIGGER_TR_GROUP9_INPUT10 */
    0, /* CYHAL_TRIGGER_TR_GROUP9_INPUT11 */
    1, /* CYHAL_TRIGGER_TR_GROUP9_INPUT12 */
    2, /* CYHAL_TRIGGER_TR_GROUP9_INPUT13 */
    3, /* CYHAL_TRIGGER_TR_GROUP9_INPUT14 */
    4, /* CYHAL_TRIGGER_TR_GROUP9_INPUT15 */
};

#endif /* CY_DEVICE_TVIIBH4M */
